brew "openssl@1.1"
brew "readline"
brew "python@3.9"
brew "libyaml"
brew "ruby"
brew "cocoapods"
brew "direnv"
brew "exa"
brew "ffmpeg"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "nvm"
brew "rbenv"
brew "scrcpy"
brew "vale"
brew "watchman"
brew "youtube-dl"
cask "vlc"
